---
kind: method
id: M:Autodesk.Revit.DB.ExtrusionAnalyzer.Dispose
source: html/5a8adeed-72ce-9eae-eca0-1d7225fcf2c5.htm
---
# Autodesk.Revit.DB.ExtrusionAnalyzer.Dispose Method

Releases all resources used by the ExtrusionAnalyzer

## Syntax (C#)
```csharp
public void Dispose()
```